# tap
tap "homebrew/bundle"

# brew
brew "autoconf"
brew "awscli"
brew "bash"
brew "deno"
brew "eza"
brew "fd"
brew "fzf"
brew "gh"
brew "git"
brew "gmp"
brew "jid"
brew "jq"
brew "libffi"
brew "libyaml"
brew "mise"
brew "readline"
brew "rustup"
brew "wget"

# cask
cask "clipy"
cask "dbeaver-community"
cask "docker-desktop"
cask "font-blex-mono-nerd-font"
cask "font-noto-sans-cjk-jp"
cask "ghostty"
cask "google-chrome"
cask "karabiner-elements"
cask "linearmouse"
cask "obsidian"
cask "visual-studio-code"
cask "warp"
